/*Ввести n (1..15) — число остановок.
С помощью for вывести расстояние от начала маршрута до каждой остановки, 
если между соседними остановками 0.8 км. 
Найти длину маршрута до n-й остановки.*/

#include <iostream>

using namespace std;

int main() {
	int n;
	int i;
	double dist = 0.8;
	double fullDist;
	cout << "Введите число остановок: ";
	cin >> n;
	if (n >= 1 && n <= 15) {
		for (i = 1; i <= n; i++) {
			fullDist = i * dist;
			cout << "Расстояние от начала маршрута до остановки номер " << i << " равно " << fullDist << endl;
		}
		cout << "Длина маршрута: " << fullDist;
	}
	else cout << "Ошибка: количество остановок должно быть не меньше 1 и не больше 15\n";
return 0;
}
